from flask import Flask, render_template
import my_janome_pra

# ==================================================
# インスタンス生成
# ==================================================
app = Flask(__name__)

# ==================================================
# ルーティング
# ==================================================
# TOPページ
@app.route('/') 
def index():
    word = my_janome_pra.wakati
    return render_template('index.html', word = word)


# ==================================================
# 実行
# ==================================================
if __name__ == '__main__':
    app.run()